; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 993845 2 2 2 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite1 Planet5)
	(have_image Planet5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 1 of 7
4. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 1 of 7
5. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 7
6. (turn_to satellite1 planet10 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet10)
   goals met: 0 of 7
7. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
8. (turn_to satellite1 star3 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star3)
   goals met: 0 of 7
9. (take_image satellite0 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 1 of 7
10. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 1 of 7
11. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 1 of 7
12. (turn_to satellite1 planet5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet5)
   goals met: 2 of 7
13. (take_image satellite0 planet6 instrument1 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 3 of 7
14. (turn_to satellite1 planet10 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet10)
   goals met: 2 of 7
15. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   goals met: 2 of 7
16. (take_image satellite1 planet10 instrument2 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 3 of 7
17. (take_image satellite0 planet5 instrument1 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 4 of 7
18. (turn_to satellite1 planet5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet5)
   goals met: 5 of 7
19. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 7
20. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 4 of 7
21. (take_image satellite0 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 5 of 7
22. (take_image satellite1 planet8 instrument2 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 6 of 7
23. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 7 of 7
